In [1]:
import pandas as pd

In [2]:
import numpy as np

In [6]:
dates = pd.date_range('20/5/2020', periods=7,freq='M')
dates

DatetimeIndex(['2020-05-31', '2020-06-30', '2020-07-31', '2020-08-31',
               '2020-09-30', '2020-10-31', '2020-11-30'],
              dtype='datetime64[ns]', freq='M')

In [8]:
np.arange(7.0)

array([0., 1., 2., 3., 4., 5., 6.])

In [13]:
pd.Series(np.arange(2,9), index=dates)

2020-05-31    2
2020-06-30    3
2020-07-31    4
2020-08-31    5
2020-09-30    6
2020-10-31    7
2020-11-30    8
Freq: M, dtype: int32

In [14]:
pd.Series(dates)

0   2020-05-31
1   2020-06-30
2   2020-07-31
3   2020-08-31
4   2020-09-30
5   2020-10-31
6   2020-11-30
dtype: datetime64[ns]

In [15]:
pd.Series(np.arange(2,9), index=[2,4,6,"sheikh","aslam",9.9,True])

2         2
4         3
6         4
sheikh    5
aslam     6
9.9       7
True      8
dtype: int32

In [19]:
# any values as list and index is allowed
ser = pd.Series(["ksll","jdkslsjdl","dfsdsd",5,7,9.0,False], index=[2,4,6,"sheikh","aslam",9.9,True])
ser

2              ksll
4         jdkslsjdl
6            dfsdsd
sheikh            5
aslam             7
9.9               9
True          False
dtype: object

In [20]:
ser[6]

'dfsdsd'

# different ways to read file

In [26]:
# file operation
f = open('ex7.csv')
for i in f:
    print(i)

"a","b","c"

"1","2","3"

"4","5","6"

In [27]:
# read using csv file reader
import csv
c = csv.reader(f)
for i in c:
    print(i)

In [29]:
# with lines
with open('ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['4', '5', '6']]

# zip function

In [49]:
a = [1,2,3,9,0]
b = [4,5,6]
c = [7,8]
list(zip(a,b,c))

[(1, 4, 7), (2, 5, 8)]

In [50]:
list(zip(lines[1],lines[2]))

[('1', '4'), ('2', '5'), ('3', '6')]

In [51]:
k, v = lines[0], lines[1:]

In [52]:
k

['a', 'b', 'c']

In [53]:
v

[['1', '2', '3'], ['4', '5', '6']]

In [54]:
list(zip(*v))

[('1', '4'), ('2', '5'), ('3', '6')]

In [55]:
list(zip(k,zip(*v)))

[('a', ('1', '4')), ('b', ('2', '5')), ('c', ('3', '6'))]

In [56]:
{k : v for k,v  in zip(k,zip(*v))}

{'a': ('1', '4'), 'b': ('2', '5'), 'c': ('3', '6')}

In [57]:
k1, v1 = lines[0], list(zip(lines[1],lines[2]))

In [58]:
v1

[('1', '4'), ('2', '5'), ('3', '6')]

# json data

In [14]:
obj = """ 
{"name":"sheikh",
 "place_lived":["India","italy","spain"],
  "pet": null,
  "sublings":[{"name":"Rohit","place_lived":["India","italy","spain"],"pets": ["browno","rocky"],"age": 32},
              {"name":"Shishir","place_lived":["India","italy","spain"],"pets": ["neo","thunder"],"age": 31}
              ]
}
"""

In [15]:
type(obj)

str

In [16]:
import json

In [17]:
per = json.loads(obj)
per

{'name': 'sheikh',
 'place_lived': ['India', 'italy', 'spain'],
 'pet': None,
 'sublings': [{'name': 'Rohit',
   'place_lived': ['India', 'italy', 'spain'],
   'pets': ['browno', 'rocky'],
   'age': 32},
  {'name': 'Shishir',
   'place_lived': ['India', 'italy', 'spain'],
   'pets': ['neo', 'thunder'],
   'age': 31}]}

In [18]:
type(per)

dict

In [19]:
per['sublings']

[{'name': 'Rohit',
  'place_lived': ['India', 'italy', 'spain'],
  'pets': ['browno', 'rocky'],
  'age': 32},
 {'name': 'Shishir',
  'place_lived': ['India', 'italy', 'spain'],
  'pets': ['neo', 'thunder'],
  'age': 31}]

In [20]:
pd.DataFrame(per['sublings'])

      name            place_lived             pets  age
0    Rohit  [India, italy, spain]  [browno, rocky]   32
1  Shishir  [India, italy, spain]   [neo, thunder]   31

In [23]:
d = pd.DataFrame(per['sublings'], columns=['name','age','pets'])
d

      name  age             pets
0    Rohit   32  [browno, rocky]
1  Shishir   31   [neo, thunder]

In [25]:
# dataframe to json
#d.to_json("sublings.json")
d.to_json("sublings.json", orient='records')

# request API

In [26]:
import requests

In [27]:
url ='https://api.github.com/repos/pandas-dev/pandas/issues'

In [29]:
r = requests.get(url)
r

In [30]:
type(r)

requests.models.Response

In [32]:
u =r.json()

In [34]:
u[0]['user']['followers_url']

'https://api.github.com/users/MarcoGorelli/followers'

In [40]:
jsondata = pd.DataFrame(u,columns=['url','state','number','user'])
jsondata

,url,state,number,user
0,https://api.github.com/repos/pandas-dev/pandas...,open,34305,"{'login': 'MarcoGorelli', 'id': 33491632, 'nod..."
1,https://api.github.com/repos/pandas-dev/pandas...,open,34304,"{'login': 'dmirecki', 'id': 7274573, 'node_id'..."
2,https://api.github.com/repos/pandas-dev/pandas...,open,34303,"{'login': 'tosingithub', 'id': 42860916, 'node..."
3,https://api.github.com/repos/pandas-dev/pandas...,open,34302,"{'login': 'matteosantama', 'id': 13473688, 'no..."
4,https://api.github.com/repos/pandas-dev/pandas...,open,34301,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."
5,https://api.github.com/repos/pandas-dev/pandas...,open,34299,"{'login': 'mcepl', 'id': 198999, 'node_id': 'M..."
6,https://api.github.com/repos/pandas-dev/pandas...,open,34298,"{'login': 'Denisolt', 'id': 17182033, 'node_id..."
7,https://api.github.com/repos/pandas-dev/pandas...,open,34297,"{'login': 'philippegr', 'id': 11066355, 'node_..."
8,https://api.github.com/repos/pandas-dev/pandas...,open,34296,"{'login': 'wicky1234444', 'id': 29908168, 'nod..."
9,https://api.github.com/repos/pandas-dev/pandas...,open,34293,"{'login': 'MarcoGorelli', 'id': 33491632, 'nod..."
10,https://api.github.com/repos/pandas-dev/pandas...,open,34292,"{'login': 'CuylenE', 'id': 13030185, 'node_id'..."
11,https://api.github.com/repos/pandas-dev/pandas...,open,34291,"{'login': 'topper-123', 'id': 26364415, 'node_..."
12,https://api.github.com/repos/pandas-dev/pandas...,open,34290,"{'login': 'sjvdm', 'id': 9049037, 'node_id': '..."
13,https://api.github.com/repos/pandas-dev/pandas...,open,34288,"{'login': 'MarcoGorelli', 'id': 33491632, 'nod..."
14,https://api.github.com/repos/pandas-dev/pandas...,open,34286,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."
15,https://api.github.com/repos/pandas-dev/pandas...,open,34285,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."
16,https://api.github.com/repos/pandas-dev/pandas...,open,34284,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."
17,https://api.github.com/repos/pandas-dev/pandas...,open,34283,"{'login': 'cuckookernel', 'id': 3910947, 'node..."
18,https://api.github.com/repos/pandas-dev/pandas...,open,34282,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."
19,https://api.github.com/repos/pandas-dev/pandas...,open,34281,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."
20,https://api.github.com/repos/pandas-dev/pandas...,open,34280,"{'login': 'joooeey', 'id': 28426758, 'node_id'..."
21,https://api.github.com/repos/pandas-dev/pandas...,open,34278,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."
22,https://api.github.com/repos/pandas-dev/pandas...,open,34277,"{'login': 'jbrockmendel', 'id': 8078968, 'node..."
23,https://api.github.com/repos/pandas-dev/pandas...,open,34275,"{'login': 'jorisvandenbossche', 'id': 1020496,..."
24,https://api.github.com/repos/pandas-dev/pandas...,open,34274,"{'login': 'SilasK', 'id': 7523034, 'node_id': ..."
25,https://api.github.com/repos/pandas-dev/pandas...,open,34273,"{'login': 'sambafall', 'id': 33497081, 'node_i..."
26,https://api.github.com/repos/pandas-dev/pandas...,open,34272,"{'login': 'arredond', 'id': 19406854, 'node_id..."
27,https://api.github.com/repos/pandas-dev/pandas...,open,34271,"{'login': 'leetschau', 'id': 1982241, 'node_id..."
28,https://api.github.com/repos/pandas-dev/pandas...,open,34270,"{'login': 'figuetbe', 'id': 35493466, 'node_id..."
29,https://api.github.com/repos/pandas-dev/pandas...,open,34267,"{'login': 'gabrielvf1', 'id': 26471896, 'node_..."

In [36]:
pd.read_html()

,url,repository_url,labels_url,comments_url,events_url,html_url,id,node_id,number,title,...,assignee,assignees,milestone,comments,created_at,updated_at,closed_at,author_association,body,pull_request
0,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/34305,623092084,MDU6SXNzdWU2MjMwOTIwODQ=,34305,"DOC: ""Setting layouts"" plots are hard to read",...,None,[],None,0,2020-05-22T09:50:44Z,2020-05-22T09:50:53Z,None,MEMBER,#### Location of the documentation\r\n\r\nhttp...,NaN
1,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/34304,623056891,MDU6SXNzdWU2MjMwNTY4OTE=,34304,BUG: Setting the index changes dtype,...,None,[],None,0,2020-05-22T08:48:22Z,2020-05-22T08:48:22Z,None,NONE,- [x] I have checked that this issue has not a...,NaN
2,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/34303,623027830,MDU6SXNzdWU2MjMwMjc4MzA=,34303,BUG: read_csv() encoding latin1 gives KeyError...,...,None,[],None,0,2020-05-22T07:56:05Z,2020-05-22T08:31:58Z,None,NONE,- [x] I have checked that this issue has not a...,NaN

In [41]:
titanic_data=pd.read_csv('https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv',sep='\t')

In [42]:
titanic_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [43]:
titanic_data.shape

(156, 12)

In [44]:
titanic_data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [46]:
titanic_data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [47]:
titanic_data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [48]:
titanic_data.index

RangeIndex(start=0, stop=156, step=1)

In [50]:
type(titanic_data.Name)

pandas.core.series.Series

In [53]:
type(titanic_data[['Name']])

pandas.core.frame.DataFrame

In [54]:
titanic_data[['Name','Fare']]

                                                  Name     Fare
0                              Braund, Mr. Owen Harris   7.2500
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  71.2833
2                               Heikkinen, Miss. Laina   7.9250
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  53.1000
4                             Allen, Mr. William Henry   8.0500
..                                                 ...      ...
151                  Pears, Mrs. Thomas (Edith Wearne)  66.6000
152                                   Meo, Mr. Alfonzo   8.0500
153                    van Billiard, Mr. Austin Blyler  14.5000
154                              Olsen, Mr. Ole Martin   7.3125
155                        Williams, Mr. Charles Duane  61.3792

[156 rows x 2 columns]

In [56]:
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [57]:
titanic_data.dtypes == 'object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [59]:
type(titanic_data.dtypes)

pandas.core.series.Series

In [64]:
i =titanic_data.dtypes[titanic_data.dtypes == 'object'].index

In [65]:
titanic_data[i].describe()

                           Name   Sex  Ticket        Cabin Embarked
count                       156   156     156           31      155
unique                      156     2     145           28        3
top     Jussila, Miss. Katriina  male  113803  C23 C25 C27        S
freq                          1   100       2            2      110

In [66]:
# delete column
del titanic_data['Pclass']

In [67]:
titanic_data

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [68]:
titanic_data['new_col_sibsp_parch']= titanic_data['SibSp']+titanic_data['Parch']

In [69]:
titanic_data

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col_sibsp_parch
0,1,0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S,1
152,153,0,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S,0
153,154,0,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S,2
154,155,0,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S,0
155,156,0,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C,1

# how to access row